Tutorials-3.0.1/gas-ssonic/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1000
(
68970
68970
68970
68970
68970
68970
68970
68970
...
)
;

boundaryField
{
    sides1
    {
        type            zeroGradient;
    }
    sides2
    {
        type            slip;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
